# PerformanceAdviserRuleId Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PerformanceAdviserRuleId Properties
PerformanceAdviserRuleId Class See Also
---
The PerformanceAdviserRuleId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Guid | The Guid of GUID-based enum object.  (Inherited from GuidEnum.) |

# See Also
PerformanceAdviserRuleId Class
Autodesk.Revit.DB Namespace